#include "Relocation.h"
#define NOMINMAX
#include <Windows.h>
#include <cstdint>
#include <PluginAPI.h>
#include <LogUtils.h>
#include <FileUtils.h>
#include <HookUtils.h>
#include <BranchTrampoline.h>
#include <GameType.h>
#include <fstream>
#include <unordered_map>
#include <vector>
#include <string>
#include <algorithm>
#include <cstdio>
#include <cstring>
#include <cstddef>
#include <cstdint>
#include <filesystem>
#include <sstream>
#include <iomanip>
#include <memory>
#include "binary_io/binary_io.hpp"

namespace fs = std::filesystem;
#define PLUGIN_NAME "LooseFileLoader"
#define PLUGIN_VERSION_MAJOR 1
#define PLUGIN_VERSION_MINOR 0
#define PLUGIN_VERSION_PATCH 0

#pragma pack(push, 1)

struct RdbRuntimeEntryDesc {
  uint32_t magic;        // +0x00, "IDRK" (0x14062BBF8 初始化 + 0x140270A44读取)
  uint32_t version;      // +0x04
  uint64_t sizeInContainer;    // +0x08, allBlockSize in rdata
  uint64_t compressedSize; // +0x10
  uint64_t fileSize;     // +0x18 uncompressedSize in rdata
  uint32_t fileKtid;     // +0x20
  uint32_t typeInfoKtid; // +0x24, 0x14038C1A4 用于 TypeHandler 查找
  uint32_t flags;        // +0x28, 0x14038B5F0: (flags>>20)&0x3F 压缩模式
  uint32_t f2C;          // +0x2C
  uint32_t paramCount; // +0x30, 0x14038C1A4 使用
  uint32_t f34;          // +0x34, 当前路径未稳定使用
  void*    paramDataBlock;  // +0x38
};
static_assert(sizeof(RdbRuntimeEntryDesc) == 0x40);
#pragma pack(pop)
// cmake --build build --config Release --target LooseFileLoader
namespace {
/*
__int64 __fastcall sub_140FCABD8(__int64 a1)
{
  if ( dword_144402DA8 > *(_DWORD *)(*(_QWORD *)NtCurrentTeb()->ThreadLocalStoragePointer + 24LL) )
  {
    Init_thread_header(&dword_144402DA8);
    if ( dword_144402DA8 == -1 )
    {
      dword_144402DB8 = 0;
      qword_144402DB0 = (__int64)off_143835828;
      qword_144402DC0 = (__int64)"ObjectDatabaseFile";
      atexit(sub_141D93C00);
      Init_thread_footer(&dword_144402DA8);
    }
  }
  return sub_140AC53E8(a1, 0x20A6A0BBLL, &qword_144402DB0);
}
*/

struct AssetDescriptor {
  std::uintptr_t vtable;
  std::uintptr_t f08;
  const char * assetName;
};
static_assert(sizeof(AssetDescriptor) == 0x18);

// ------------------------------ RDB / RDX -----------------------------------

struct RdxEntry {
    std::uint16_t index = 0;
